/**
 *
 * Создать класс, который содержит int и char (не проинициализированные) и распечатать их

 значения.
 * Created by 1 on 07.06.2016.
 */
public  class Data {
    int i;
    char j;



    public static void main(String [] args) {
        Data data = new Data();
        System.out.println(data.i + " " + data.j);

    }
}
